<?php

return[
    'success'  => 'تم بنجاح',
    'failed'   => 'فشل',
    'index'    => 'تم الحصول على البيانات بنجاح	',
    'show'     => 'تم عرض البيانات بنجاح',
    'done'     => [
        'store'  => 'تم إضافة البيانات بنجاح',
        'update' => 'تم تعديل البيانات بنجاح',
        'delete' => 'تم حذف البيانات بنجاح',
        'cancel' => 'تم الغاء الحجز بنجاح'
    ],
    'error'    => [
        'store'      => 'فشل في حفظ البيانات',
        'update'     => 'فشل في تعديل البيانات',
        'delete'     => 'فشل في حذف البيانات',
        'permission' => 'ليس لديك صلاحية للوصول إلى البيانات',
    ],
    'auth'     => [
        'check_your_sms'       => 'يرجى التحقق من الرسائل النصية',
        'invalid_email_or_otp' => ' البريد الالكترونى غير صحيح - انتهى صلاحيه التحقق ',
        'expired_otp'          => 'الرقم  غير صحيح - انتهى صلاحيه التحقق',
        'verified_and_create'  => 'تم التحقق من البريد الالكترونى بنجاح و اضافه حساب جديد',
        'wrong_number'         => 'الرقم غير صحيح',
        'wrong_pass'           => 'الرقم السرى غير صحيح',
        'no_user'              => 'لا يوجد حساب لهذا المستخدم',
        'change_pass'          => ' تم تغيير الرقم السري بنجاح',
        'change_number'        => ' تم تغيير الرقم بنجاح',
        'invalid_login'        => 'تسجيل الدخول غير صالح. يرجى التحقق من رقم الهاتف وكلمة المرور',
        'logout'               => ' تم تسجيل الخروج بنجاح',
    ],
    'favorite' => [
        'add'   => ' تم اضافه الدكتور الى المفضلة',
        'exist' => 'الدكتور موجود بالفعل',
        'remove' => 'تم ازاله الدكتور من المفضله ',
    ],
    'offer'    => [
        'not_added' => 'لا يمكنك حجز العرض مرتين في نفس الوقت',
        'add'       => 'تم اضافه العرض الى حسابك',
        'max_reservation' => 'تم الوصول إلى الحد الأقصى المسموح به من الحجوزات لهذا العرض',

    ],
    'payment'  => [
        'paid_offer'    => 'لا يمكن تنفيذ العملية، العرض مدفوع أو غير محجوز.',
        'sessionId'     => 'Session ID مطلوب.' ,
        'offer_closed'  => 'تم دفع هذا العرض بالفعل أو انتهى الوقت المحدد له.',
        'pay'           => 'تمت عمليه الدفع بنجاح',
        'not_completed' => 'عمليه الدفع لم تكتمل',
    ]
];
